# Taps
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew "bat"
brew 'bitwarden-cli'
brew 'cmatrix'
brew 'coreutils' # Those that come with macOS are outdated
brew 'fastfetch'
brew 'fzf'
brew 'git'
brew 'grep'
brew 'htop'
brew 'lynx'
brew 'mas' # Mac App Store manager
brew "n"
brew 'openjdk'
brew 'powerlevel10k'
brew 'pv'
brew 'speedtest-cli'
brew 'thefuck'
brew 'tldr'
brew "topgrade"
brew 'tree'
brew 'wget'

# Apps
cask 'discord'
cask 'docker'
cask 'duckduckgo'
cask 'elmedia-player'
cask 'firefox'
cask 'font-meslo-for-powerlevel10k'
cask 'gimp'
cask 'github'
cask 'google-chrome'
cask 'grammarly-desktop'
cask 'imazing'
cask 'iterm2'
cask 'itsycal'
cask 'libreoffice'
cask 'libreoffice-language-pack'
cask 'macvim'
cask 'microsoft-edge'
cask 'monitorcontrol'
cask 'obsidian'
cask 'opera'
cask 'oversight'
cask 'postman'
cask 'raycast'
cask 'reverso'
cask 'rocket-chat'
cask 'signal'
cask 'slack'
cask 'stats'
cask 'sublime-text'
cask 'tunnelblick'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'vivaldi'
cask 'warp'
cask 'zoom'

# Fonts
cask 'font-hack-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Bitwarden', id: 1352778147
mas 'Giphy Capture', id: 668208984
mas 'little-faker', id: 1609309817
mas 'Speedtest', id: 1153157709
mas 'toggl-track-hours-time-log', id: 1291898086
mas 'xcode', id: 497799835
